# Text Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..Text Property
TextNode Class See Also
---
The content of the text annotation as a plain string stripped of all formatting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string Text { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Text As String
	Get
```

Visual C++
---
```text
public:
property String^ Text {
	String^ get ();
}
```

# Remarks
The text may contain new-lines if there are any in the text annotation.
# See Also
TextNode Class
Autodesk.Revit.DB Namespace